run/DA0120/DA0120GasSc/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/data/ablParams"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    vapourInlet
    {
        type                flowRateInletVelocity;
        volumetricFlowRate  $volFlowRate;
        value               uniform (0 0 0);
    }
    frontField
    { 
        type            fixedProfile;
        profile         csvFile;
        profileCoeffs
        {
            nHeaderLine         0;
            refColumn           0;  
            componentColumns    (1 2 3); 
            mergeSeparators     no;         
            file                "$FOAM_CASE/data/Vel.csv";
            outOfBounds         clamp;
            interpolationScheme linear;
        }
        direction        (0 0 1);
        origin           0;
    }
    backField
    {   
        type            zeroGradient;
    }   
    sideField
    {   
        type            fixedProfile;
        profile         csvFile;
        profileCoeffs
        {
            nHeaderLine         0;
            refColumn           0;  
            componentColumns    (1 2 3); 
            mergeSeparators     no;         
            file                "$FOAM_CASE/data/Vel.csv";
            outOfBounds         clamp;
            interpolationScheme linear;
        }
        direction        (0 0 1);
        origin           0;
    }   
    top 
    {   
	type		fixedGradient;
	gradient	uniform $topShear;		
    }
    ground
    {
        type            noSlip;
    }
    symPlane
    {
        type            symmetryPlane;
    }
}
// ************************************************************************* //
