run/DA0120/DA0120GasSc/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
type            probes;
functionObjectLibs ("libsampling.so");
writeControl  runTime;
writeInterval   1;
fields (SF6);
probeLocations
(
    #include "$FOAM_CASE/data/foamPosC.csv"
);

// ************************************************************************* //
